Revit 2026 API
Floor.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
Create(Document, IList<CurveLoop>, ElementId, ElementId, Boolean, Line, Double)
Top
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace